zephyrproject-rtos/zephyr/drivers/flash/flash_stm32_qspi.c
/*
 * Copyright (c) 2020 Piotr Mienkowski
 * Copyright (c) 2020 Linaro Limited
 * Copyright (c) 2022 Georgij Cernysiov
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_qspi_nor

#include <errno.h>
#include <zephyr/kernel.h>
#include <zephyr/toolchain.h>
#include <zephyr/arch/cpu.h>
#include <zephyr/sys/__assert.h>
#include <zephyr/sys/util.h>
#include <soc.h>
#include <stm32_bitops.h>
#include <string.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/drivers/flash/stm32_flash_api_extensions.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/gpio.h>

#ifdef CONFIG_USERSPACE
#include <zephyr/syscall.h>
#include <zephyr/internal/syscall_handler.h>
#endif

#if DT_INST_NODE_HAS_PROP(0, spi_bus_width) && \
	DT_INST_PROP(0, spi_bus_width) == 4
#define STM32_QSPI_USE_QUAD_IO 1
#else
#define STM32_QSPI_USE_QUAD_IO 0
#endif

#define STM32_QSPI_NODE DT_INST_PARENT(0)
/* Get the base address of the flash from the DTS st,stm32-qspi node */
#define STM32_QSPI_BASE_ADDRESS DT_REG_ADDR_BY_IDX(STM32_QSPI_NODE, 1)

#define STM32_QSPI_RESET_GPIO DT_INST_NODE_HAS_PROP(0, reset_gpios)
#define STM32_QSPI_RESET_CMD  DT_INST_PROP(0, reset_cmd)

#include <stm32_ll_dma.h>

#include "spi_nor.h"
#include "jesd216.h"

#include <zephyr/logging/log.h>
#include <zephyr/irq.h>
LOG_MODULE_REGISTER(flash_stm32_qspi, CONFIG_FLASH_LOG_LEVEL);

#define STM32_QSPI_FIFO_THRESHOLD         8
#define STM32_QSPI_CLOCK_PRESCALER_MAX  255

#define STM32_QSPI_UNKNOWN_MODE (0xFF)

#define STM32_QSPI_USE_DMA DT_NODE_HAS_PROP(DT_INST_PARENT(0), dmas)

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32_qspi_nor)

/* In dual-flash mode, total size is twice the size of one flash component */
#define STM32_QSPI_DOUBLE_FLASH	DT_PROP(DT_NODELABEL(quadspi), dual_flash)

#if STM32_QSPI_DOUBLE_FLASH
#define FLASH_REG_FMT "%04x"
#else
#define FLASH_REG_FMT "%02x"
#endif /* STM32_QSPI_DOUBLE_FLASH */

/*
 * A register of the flash device, such as a status register.
 *
 * When dual-flash mode is enabled, this structure contains the value of the actual register of both
 * flash memories. For example, if an instance of this structure is used to hold the value of the
 * status register, 'flash0_val' and 'flash1_val' will be equal respectively to the value of the
 * status register of the first and second flash memory.
 *
 * This structure is packed as it is directly sent/received over the QSPI bus.
 */
struct flash_reg {
	uint8_t flash0_val;
#if STM32_QSPI_DOUBLE_FLASH
	uint8_t flash1_val;
#endif /* STM32_QSPI_DOUBLE_FLASH */
} __packed;

/*
 * Sets a bit in a flash register.
 *
 * In dual-flash mode, the value is updated for both flash memories.
 */
static inline void flash_reg_set_for_all(struct flash_reg *reg, uint8_t bitmask)
{
	reg->flash0_val |= bitmask;
#if STM32_QSPI_DOUBLE_FLASH
	reg->flash1_val |= bitmask;
#endif /* STM32_QSPI_DOUBLE_FLASH */
}

/*
 * Checks if a bit is set in a flash register.
 *
 * In dual-flash mode, this routine returns true if and only if the bit is set for both flash
 * memories.
 */
static inline bool flash_reg_is_set_for_all(struct flash_reg *reg, uint8_t bitmask)
{
	bool is_set = (reg->flash0_val & bitmask) != 0U;

#if STM32_QSPI_DOUBLE_FLASH
	is_set = is_set && ((reg->flash1_val & bitmask) != 0U);
#endif /* STM32_QSPI_DOUBLE_FLASH */

	return is_set;
}

/*
 * Checks if a bit is clear in a flash register.
 *
 * In dual-flash mode, this routine returns true if and only if the bit is clear for both flash
 * memories.
 */
static inline bool flash_reg_is_clear_for_all(struct flash_reg *reg, uint8_t bitmask)
{
	bool is_clear = (reg->flash0_val & bitmask) == 0U;

#if STM32_QSPI_DOUBLE_FLASH
	is_clear = is_clear && ((reg->flash1_val & bitmask) == 0U);
#endif /* STM32_QSPI_DOUBLE_FLASH */

	return is_clear;
}

/*
 * Gets the raw representation of a flash register, as a uint16_t value where the lower byte is the
 * value for the first flash memory and the upper byte is the value for the second flash memory, if
 * any.
 */
static inline uint16_t flash_reg_to_raw(const struct flash_reg *reg)
{
	uint16_t raw = reg->flash0_val;

#if STM32_QSPI_DOUBLE_FLASH
	raw |= reg->flash1_val << 8;
#endif /* STM32_QSPI_DOUBLE_FLASH */

	return raw;
}

typedef void (*irq_config_func_t)(const struct device *dev);

struct stream {
	DMA_TypeDef *reg;
	const struct device *dev;
	uint32_t channel;
	struct dma_config cfg;
};

struct flash_stm32_qspi_config {
	struct stm32_pclken pclken;
	irq_config_func_t irq_config;
	size_t flash_size;
	uint32_t max_frequency;
	uint8_t cs_high_time;
	const struct pinctrl_dev_config *pcfg;
#if STM32_QSPI_RESET_GPIO
	const struct gpio_dt_spec reset;
#endif
#if DT_NODE_HAS_PROP(DT_INST(0, st_stm32_qspi_nor), jedec_id)
	uint8_t jedec_id[DT_INST_PROP_LEN(0, jedec_id)];
#endif /* jedec_id */
};

struct flash_stm32_qspi_data {
	QSPI_HandleTypeDef hqspi;
	struct k_sem sem;
	struct k_sem sync;
#if defined(CONFIG_FLASH_PAGE_LAYOUT)
	struct flash_pages_layout layout;
#endif
	struct jesd216_erase_type erase_types[JESD216_NUM_ERASE_TYPES];
	/* Number of bytes per page */
	uint16_t page_size;
	enum jesd216_dw15_qer_type qer_type;
	enum jesd216_mode_type mode;
	int cmd_status;
	struct stream dma;
	uint8_t qspi_write_cmd;
	uint8_t qspi_read_cmd;
	uint8_t qspi_read_cmd_latency;
	/*
	 * If set addressed operations should use 32-bit rather than
	 * 24-bit addresses.
	 */
	bool flag_access_32bit: 1;
};

static const QSPI_CommandTypeDef cmd_write_en = {
	.Instruction = SPI_NOR_CMD_WREN,
	.InstructionMode = QSPI_INSTRUCTION_1_LINE
};

static inline void qspi_lock_thread(const struct device *dev)
{
	struct flash_stm32_qspi_data *dev_data = dev->data;

	k_sem_take(&dev_data->sem, K_FOREVER);
}

static inline void qspi_unlock_thread(const struct device *dev)
{
	struct flash_stm32_qspi_data *dev_data = dev->data;

	k_sem_give(&dev_data->sem);
}

